## Plan Result (nonprod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 0 to change, 8 to destroy.</code></pre>

* Create
  * module.utiac.sendgrid_domain_authentication.domain-authenticate[&#34;mail-utiac-nonprod.platform.hmcts.net&#34;]
  * module.utiac-dns.azurerm_dns_cname_record.record1[&#34;mail-utiac-nonprod.platform.hmcts.net&#34;]
  * module.utiac-dns.azurerm_dns_cname_record.record2[&#34;mail-utiac-nonprod.platform.hmcts.net&#34;]
  * module.utiac-dns.azurerm_dns_cname_record.record3[&#34;mail-utiac-nonprod.platform.hmcts.net&#34;]
* Delete
  * module.utiac.sendgrid_domain_authentication.domain-authenticate[&#34;nonprod-tribunalsdecisions-utiac.service.gov.uk&#34;]
  * module.utiac-dns.azurerm_dns_cname_record.record1[&#34;nonprod-tribunalsdecisions-utiac.service.gov.uk&#34;]
  * module.utiac-dns.azurerm_dns_cname_record.record2[&#34;nonprod-tribunalsdecisions-utiac.service.gov.uk&#34;]
  * module.utiac-dns.azurerm_dns_cname_record.record3[&#34;nonprod-tribunalsdecisions-utiac.service.gov.uk&#34;]
* Replace
  * module.pcol.sendgrid_domain_authentication.domain-authenticate[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record1[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record2[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record3[&#34;hmcts.net&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.pcol.sendgrid_domain_authentication.domain-authenticate["hmcts.net"] must be replaced
-/+ resource "sendgrid_domain_authentication" "domain-authenticate" {
      + custom_dkim_selector = "pnl" # forces replacement
      - custom_spf           = false -> null
      ~ dns                  = [
          - {
              - data  = "pnl.domainkey.u33702686.wl187.sendgrid.net"
              - host  = "pnl._domainkey.hmcts.net"
              - type  = "cname"
              - valid = false
            },
          - {
              - data  = "pnl2.domainkey.u33702686.wl187.sendgrid.net"
              - host  = "pnl2._domainkey.hmcts.net"
              - type  = "cname"
              - valid = false
            },
          - {
              - data  = "u33702686.wl187.sendgrid.net"
              - host  = "em4013.hmcts.net"
              - type  = "cname"
              - valid = false
            },
        ] -> (known after apply)
      ~ id                   = "20456908" -> (known after apply)
      ~ ips                  = [] -> (known after apply)
      ~ subdomain            = "em4013" -> (known after apply)
      ~ username             = "hmcts-pcol-nonprod" -> (known after apply)
      ~ valid                = false -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record1["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record1" {
      ~ fqdn                = "pnl._domainkey.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/pnl._domainkey" -> (known after apply)
      ~ name                = "pnl._domainkey" # forces replacement -> (known after apply) # forces replacement
      ~ record              = "pnl.domainkey.u33702686.wl187.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record2["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record2" {
      ~ fqdn                = "pnl2._domainkey.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/pnl2._domainkey" -> (known after apply)
      ~ name                = "pnl2._domainkey" # forces replacement -> (known after apply) # forces replacement
      ~ record              = "pnl2.domainkey.u33702686.wl187.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record3["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record3" {
      ~ fqdn                = "em4013.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/em4013" -> (known after apply)
      ~ name                = "em4013" # forces replacement -> (known after apply) # forces replacement
      ~ record              = "u33702686.wl187.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.utiac.sendgrid_domain_authentication.domain-authenticate["mail-utiac-nonprod.platform.hmcts.net"] will be created
  + resource "sendgrid_domain_authentication" "domain-authenticate" {
      + automatic_security = true
      + dns                = (known after apply)
      + domain             = "mail-utiac-nonprod.platform.hmcts.net"
      + id                 = (known after apply)
      + ips                = (known after apply)
      + is_default         = true
      + subdomain          = (known after apply)
      + username           = (known after apply)
      + valid              = (known after apply)
    }

  # module.utiac.sendgrid_domain_authentication.domain-authenticate["nonprod-tribunalsdecisions-utiac.service.gov.uk"] will be destroyed
  # (because key ["nonprod-tribunalsdecisions-utiac.service.gov.uk"] is not in for_each map)
  - resource "sendgrid_domain_authentication" "domain-authenticate" {
      - automatic_security = true -> null
      - custom_spf         = false -> null
      - dns                = [
          - {
              - data  = "s1.domainkey.u42091900.wl151.sendgrid.net"
              - host  = "s1._domainkey.nonprod-tribunalsdecisions-utiac.service.gov.uk"
              - type  = "cname"
              - valid = false
            },
          - {
              - data  = "s2.domainkey.u42091900.wl151.sendgrid.net"
              - host  = "s2._domainkey.nonprod-tribunalsdecisions-utiac.service.gov.uk"
              - type  = "cname"
              - valid = false
            },
          - {
              - data  = "u42091900.wl151.sendgrid.net"
              - host  = "em3333.nonprod-tribunalsdecisions-utiac.service.gov.uk"
              - type  = "cname"
              - valid = false
            },
        ] -> null
      - domain             = "nonprod-tribunalsdecisions-utiac.service.gov.uk" -> null
      - id                 = "20456906" -> null
      - ips                = [] -> null
      - is_default         = true -> null
      - subdomain          = "em3333" -> null
      - username           = "hmcts-utiac-nonprod" -> null
      - valid              = false -> null
    }

  # module.utiac-dns.azurerm_dns_cname_record.record1["mail-utiac-nonprod.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record1" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.utiac-dns.azurerm_dns_cname_record.record1["nonprod-tribunalsdecisions-utiac.service.gov.uk"] will be destroyed
  # (because key ["nonprod-tribunalsdecisions-utiac.service.gov.uk"] is not in for_each map)
  - resource "azurerm_dns_cname_record" "record1" {
      - fqdn                = "s1._domainkey.nonprod-tribunalsdecisions-utiac.service.gov.uk.tribunalsdecisions.service.gov.uk." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/tribunalsdecisions.service.gov.uk/CNAME/s1._domainkey.nonprod-tribunalsdecisions-utiac.service.gov.uk" -> null
      - name                = "s1._domainkey.nonprod-tribunalsdecisions-utiac.service.gov.uk" -> null
      - record              = "s1.domainkey.u42091900.wl151.sendgrid.net" -> null
      - resource_group_name = "reformmgmtrg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "tribunalsdecisions.service.gov.uk" -> null
    }

  # module.utiac-dns.azurerm_dns_cname_record.record2["mail-utiac-nonprod.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record2" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.utiac-dns.azurerm_dns_cname_record.record2["nonprod-tribunalsdecisions-utiac.service.gov.uk"] will be destroyed
  # (because key ["nonprod-tribunalsdecisions-utiac.service.gov.uk"] is not in for_each map)
  - resource "azurerm_dns_cname_record" "record2" {
      - fqdn                = "s2._domainkey.nonprod-tribunalsdecisions-utiac.service.gov.uk.tribunalsdecisions.service.gov.uk." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/tribunalsdecisions.service.gov.uk/CNAME/s2._domainkey.nonprod-tribunalsdecisions-utiac.service.gov.uk" -> null
      - name                = "s2._domainkey.nonprod-tribunalsdecisions-utiac.service.gov.uk" -> null
      - record              = "s2.domainkey.u42091900.wl151.sendgrid.net" -> null
      - resource_group_name = "reformmgmtrg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "tribunalsdecisions.service.gov.uk" -> null
    }

  # module.utiac-dns.azurerm_dns_cname_record.record3["mail-utiac-nonprod.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record3" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.utiac-dns.azurerm_dns_cname_record.record3["nonprod-tribunalsdecisions-utiac.service.gov.uk"] will be destroyed
  # (because key ["nonprod-tribunalsdecisions-utiac.service.gov.uk"] is not in for_each map)
  - resource "azurerm_dns_cname_record" "record3" {
      - fqdn                = "em3333.nonprod-tribunalsdecisions-utiac.service.gov.uk.tribunalsdecisions.service.gov.uk." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/tribunalsdecisions.service.gov.uk/CNAME/em3333.nonprod-tribunalsdecisions-utiac.service.gov.uk" -> null
      - name                = "em3333.nonprod-tribunalsdecisions-utiac.service.gov.uk" -> null
      - record              = "u42091900.wl151.sendgrid.net" -> null
      - resource_group_name = "reformmgmtrg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "tribunalsdecisions.service.gov.uk" -> null
    }

Plan: 8 to add, 0 to change, 8 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":66,"Program":"tfcmt","SHA1":"","Target":"nonprod","Vars":{}} -->